---
kind: method
id: M:Autodesk.Revit.DB.DirectShape.GetOptions
source: html/2bc77946-040e-7c75-0258-373adb8d2966.htm
---
# Autodesk.Revit.DB.DirectShape.GetOptions Method

Gets a copy of the current options for this DirectShape.

## Syntax (C#)
```csharp
public DirectShapeOptions GetOptions()
```

## Returns
Options currently set for this DirectShape.